jmeter/results/assertion-negative/console.txt
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Creating summariser <summary>
Created the tree successfully using jmeter/seckill-500.jmx
Starting standalone test @ September 14, 2026 10:25:59 PM CST (1789395959123)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary +      1 in 00:00:01 =    1.3/s Avg:    35 Min:    35 Max:    35 Err:     1 (100.00%) Active: 1 Started: 1 Finished: 0
summary +      5 in 00:00:00 =  102.0/s Avg:     6 Min:     4 Max:    13 Err:     5 (100.00%) Active: 0 Started: 1 Finished: 1
summary =      6 in 00:00:01 =    7.2/s Avg:    10 Min:     4 Max:    35 Err:     6 (100.00%)
Tidying up ...    @ September 14, 2026 10:26:00 PM CST (1789395960369)
... end of run