jmeter/results/server-check/console.txt
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
WARN StatusConsoleListener The use of package scanning to locate plugins is deprecated and will be removed in a future release
[...]
Sep 14, 2026 10:44:33 PM java.util.prefs.FileSystemPreferences$1 run
INFO: Created user preferences directory.
Creating summariser <summary>
Created the tree successfully using /path/to/hmdp-m7/jmeter/seckill-500.jmx
Starting standalone test @ September 14, 2026 10:44:34 PM CST (1789397074209)
Waiting for possible Shutdown/StopTestNow/HeapDump/ThreadDump message on port 4445
summary +      1 in 00:00:01 =    1.0/s Avg:    15 Min:    15 Max:    15 Err:     0 (0.00%) Active: 9 Started: 9 Finished: 0
summary +   1404 in 00:00:09 =  153.5/s Avg:    63 Min:     5 Max:   382 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
summary =   1405 in 00:00:10 =  138.7/s Avg:    63 Min:     5 Max:   382 Err:     0 (0.00%)
Tidying up ...    @ September 14, 2026 10:44:44 PM CST (1789397084822)
... end of run